stenoisis/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
	(0 0 0)
	(20 0 0)
	(20 3 0)
	(0 3 0)
	(0 0 0.1)
	(20 0 0.1)
	(20 3 0.1)
	(0 3 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (160 24 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet_artery
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    outlet_artery
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }

    back
    {
        type  empty;
        faces
        (
            (4 7 6 5)	
        );
    }

    wallArtery
    {
	    type wall;
	    faces
        (
            (3 2 6 7)
            (1 0 4 5)
        );
    }

    wallCatheter
    {
        type wall;
        faces ();
    }
);

// ************************************************************************* //
