stenoisis/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;
patches
(
   {
        name inlet_pores;
        patchInfo
        {
            type patch;
        }

        constructFrom set;
        set     pores;
    }

    {
        name catheter_wall;
        patchInfo
        {
            type wall;
        }

        constructFrom set;
        set     catheter;
    }
);

// ************************************************************************* //
