stenoisis/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    catheter;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo  
        {
            name wallCatheter;
        }
    }

    {
        name pores;
        type faceSet;
        action new;
        source boxToFace;
        sourceInfo
        {
            box (0.01 0.000999 -0.0001)(0.01002 0.00101 0);
            //box (0.01 0.000999 -0.0001)(0.01002 0.0020001 0);
        }
    }

    {
        name    catheter;
        type    faceSet;
        action  delete;
        source faceToFace;
        sourceInfo
        {
            set     pores;
        }
    }
);

// ************************************************************************* //
